app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."out_url" = 'ghghghgh' LIMIT 1
---
  def go
    @link = Link.find_by_out_url!(params[:out_url])

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @link = Link.find(params[:id])

INSERT INTO "links" ("created_at", "http_status", "in_url", "out_url", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 06 Mar 2012 21:19:12 UTC +00:00], ["http_status", 301], ["in_url", "www.google.com"], ["out_url", "ghghghgh"], ["updated_at", Tue, 06 Mar 2012 21:19:12 UTC +00:00]]
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save